### Terraform Plan Results:
```
random_id.bucket_suffix: Refreshing state... [id=IUUDkg]
random_id.bucket_id: Refreshing state... [id=DLnwNg]
aws_s3_bucket.tf_state_bucket: Refreshing state... [id=my-unique-tfstate-bucket-1234]
aws_dynamodb_table.tf_lock_table: Refreshing state... [id=terraform-lock-table]
aws_iam_role.ec2_role: Refreshing state... [id=terraform_iam_role]
aws_vpc.main: Refreshing state... [id=vpc-05ed0a2afe2724e13]
aws_iam_policy.terraform_policy: Refreshing state... [id=arn:aws:iam::703671893205:policy/terraform_full_access_policy]
data.aws_ami.amazon_linux_2: Reading...
aws_s3_bucket.kafka_bucket: Refreshing state... [id=kafka-bucket-0cb9f036]
aws_s3_bucket.example: Refreshing state... [id=my-example-bucket-21450392]
aws_iam_role_policy_attachment.attach_terraform_policy: Refreshing state... [id=terraform_iam_role-20250222190645536000000001]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=terraform_instance_profile]
aws_s3_bucket_public_access_block.bucket_block: Refreshing state... [id=kafka-bucket-0cb9f036]
aws_s3_bucket_public_access_block.tf_state_bucket_block: Refreshing state... [id=my-unique-tfstate-bucket-1234]
data.aws_ami.amazon_linux_2: Read complete after 0s [id=ami-0c104f6f4a5d9d1d5]
aws_security_group.allow_customip: Refreshing state... [id=sg-09a39cb2cb394d094]
aws_internet_gateway.igw: Refreshing state... [id=igw-07e5400c533247667]
aws_subnet.public: Refreshing state... [id=subnet-064b2fa8425e5b9b6]
aws_route_table.public: Refreshing state... [id=rtb-0d15564cb3b378d48]
aws_instance.web: Refreshing state... [id=i-00db76b7c6743caa9]
aws_instance.jenkins-runner: Refreshing state... [id=i-09618af6a96474ccc]
aws_route_table_association.public_assoc: Refreshing state... [id=rtbassoc-08b3f4848f6a8e104]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_iam_policy.terraform_policy has been deleted
  - resource "aws_iam_policy" "terraform_policy" {
      - arn              = "arn:aws:iam::703671893205:policy/terraform_full_access_policy" -> null
        id               = "arn:aws:iam::703671893205:policy/terraform_full_access_policy"
        name             = "terraform_full_access_policy"
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role.ec2_role has been deleted
  - resource "aws_iam_role" "ec2_role" {
        id                    = "terraform_iam_role"
      - name                  = "terraform_iam_role" -> null
        tags                  = {}
        # (12 unchanged attributes hidden)
    }

  # aws_instance.web has changed
  ~ resource "aws_instance" "web" {
        id                                   = "i-00db76b7c6743caa9"
      + public_ip                            = "54.198.11.183"
        tags                                 = {
            "Name" = "web-instance"
        }
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_instance_profile.ec2_instance_profile will be updated in-place
  ~ resource "aws_iam_instance_profile" "ec2_instance_profile" {
        id          = "terraform_instance_profile"
        name        = "terraform_instance_profile"
      + role        = "terraform_iam_role"
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.terraform_policy will be created
  + resource "aws_iam_policy" "terraform_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy granting full access to AWS for Terraform deployments."
      + id               = (known after apply)
      + name             = "terraform_full_access_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "FullAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform_iam_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_terraform_policy will be created
  + resource "aws_iam_role_policy_attachment" "attach_terraform_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "terraform_iam_role"
    }

  # aws_instance.jenkins-runner will be updated in-place
  ~ resource "aws_instance" "jenkins-runner" {
        id                                   = "i-09618af6a96474ccc"
      ~ public_dns                           = "ec2-52-90-119-95.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.90.119.95" -> (known after apply)
        tags                                 = {
            "Name" = "jenkins-runner"
        }
      ~ user_data                            = "997e2ebe205a672879ebfe19405e664652d5a439" -> "7f64a8e0c5eeb645171378e5466e9054634517b5"
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.web will be updated in-place
  ~ resource "aws_instance" "web" {
        id                                   = "i-00db76b7c6743caa9"
      ~ public_dns                           = "ec2-54-198-11-183.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.198.11.183" -> (known after apply)
        tags                                 = {
            "Name" = "web-instance"
        }
      ~ user_data                            = "de0fd51734e34c142e8060ee1822239e9969d262" -> "0a79d4ac9ee12b38d4935c3bef8f41b8c979948c"
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_s3_bucket.example will be destroyed
  # (because aws_s3_bucket.example is not in configuration)
  - resource "aws_s3_bucket" "example" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::my-example-bucket-21450392" -> null
      - bucket                      = "my-example-bucket-21450392" -> null
      - bucket_domain_name          = "my-example-bucket-21450392.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "my-example-bucket-21450392.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "my-example-bucket-21450392" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "Test"
          - "Name"        = "ExampleS3Bucket"
        } -> null
      - tags_all                    = {
          - "Environment" = "Test"
          - "Name"        = "ExampleS3Bucket"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "a3c142d57310d0e63c976a03c1b227c8342ab809455727dc76ca8e337c640938" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.example3 will be created
  + resource "aws_s3_bucket" "example3" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "my-example-bucket3-21450392"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Test"
          + "Name"        = "ExampleS3Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Test"
          + "Name"        = "ExampleS3Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }

      + website (known after apply)
    }

  # aws_security_group.allow_customip will be updated in-place
  ~ resource "aws_security_group" "allow_customip" {
        id                     = "sg-09a39cb2cb394d094"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = [
                  - "188.122.20.76/32",
                  - "10.0.1.0/24",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "allow-customip-sg"
        tags                   = {
            "Name" = "allow-customip-sg"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 4 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  ~ ec2_instance_public_ip = null -> (known after apply)

Warning: Argument is deprecated

  with aws_s3_bucket.tf_state_bucket,
  on s3-lock.tf line 1, in resource "aws_s3_bucket" "tf_state_bucket":
   1: resource "aws_s3_bucket" "tf_state_bucket" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 12 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```